[
{"title": "Carlyle eyes fresh backers for McDonald's China arm - Bloomberg News", "url": "https://www.channelnewsasia.com/business/carlyle-eyes-fresh-backers-mcdonalds-china-arm-bloomberg-news-3434641", "description": ":Carlyle Group Inc is considering bringing in fresh backers for its investment in McDonald's Corp's China operations, seeking a valuation of $8-$10 billion for the business, Bloomberg News reported on Friday.Carlyle, which controls McDonald's China along with Trustar Capital, could sell down part of their sta", "date": "2023-04-21T14:33:09+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Memulihara tapak warisan di Pulau Pinang: Para aktivis cuba selamatkan lebih banyak bangunan bersejarah", "url": "https://www.channelnewsasia.com/malaysia/tapak-warisan-dunia-pulau-pinang-aktivis-selamat-bangunan-bersejarah-george-town-3431856", "description": "Mengapa pihak berkuasa tempatan dikatakan gagal melakukan secukupnya untuk memulihara struktur warisan di George Town, termasuk sebuah banglo lama yang pernah didiami Sir Stamford Raffles.", "date": "2023-04-21T16:00:57+08:00", "category": "www.channelnewsasia.com", "keywords": "Malaysia,heritage,conservation,Penang", "source": "cna", "region": "LOCAL"},
{"title": "'Art is continuous resistance': Sudanese cartoonist draws to bring hope, truth", "url": "https://www.channelnewsasia.com/cna-lifestyle/art-continuous-resistance-sudanese-cartoonist-draws-bring-hope-truth-3434751", "description": "OSLO : In his living room in Norway, while the TV broadcasts pictures of the violence back home in Khartoum, Khalid Albaih does what he has become known for in the Middle East and beyond: draw cartoons.His latest, entitled The Dog Fight, depicts the two main Sudanese foes, army chief General Abdel Fattah", "date": "2023-04-21T15:40:21+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Spurs director Paratici resigns after ban appeal rejected", "url": "https://www.channelnewsasia.com/sport/spurs-director-paratici-resigns-after-ban-appeal-rejected-3434746", "description": ":Fabio Paratici has resigned as Tottenham Hotspur's managing director of football after his appeal against a 30-month ban from football was rejected by Italy's top sports body, the Premier League club said on Friday.Paratici lodged his appeal in Italy after governing body FIFA extended the ban imposed on him", "date": "2023-04-21T15:42:34+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Twitter drops 'state-affiliated' tags for media accounts", "url": "https://www.channelnewsasia.com/business/twitter-drops-state-affiliated-tags-media-accounts-russia-china-npr-xinhua-3434676", "description": "SAN FRANCISCO: Twitter has dropped \"state-affiliated\" and \"government-funded\" labels from media accounts, according to a review by AFP on Friday (Apr 21) of many high-profile pages on the platform. Many major media outlets from Western nations, Russia, China and other countries that previously had eit", "date": "2023-04-21T14:36:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Twitter,Elon Musk", "source": "cna", "region": "LOCAL"},
{"title": "BOJ sees 'sound and resilient' financial system despite some jitters", "url": "https://www.channelnewsasia.com/business/boj-sees-sound-and-resilient-financial-system-despite-some-jitters-3434771", "description": "TOKYO: Japan's financial system has remained \"sound and resilient\" despite heightened financial sector jitters in the West stemming from US bank failures in March, the Bank of Japan said in its semi-annual financial system report. However, the central bank also said that vigilance against tail risks was wa", "date": "2023-04-21T15:43:00+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Italy's antitrust takes steps against Meta in music rights case", "url": "https://www.channelnewsasia.com/business/italys-antitrust-takes-steps-against-meta-music-rights-case-3434681", "description": "MILAN : Italy's antitrust authority said on Friday it had taken measures against Meta Platform over an alleged abuse of its position in the country, in a probe involving the rights to music posted on the group's platforms.Last month, Meta, which owns Facebook, Whatsapp and Instagram, failed to reach a dea", "date": "2023-04-21T14:34:32+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Indonesia's PDI-P picks Central Java governor Ganjar Pranowo as presidential candidate", "url": "https://www.channelnewsasia.com/asia/indonesia-election-president-ganjar-pranowo-pdip-megawati-soekarnoputri-3434236", "description": "JAKARTA: The Indonesian Democratic Party of Struggle (PDI-P) on Friday (April 21) announced that Central Java governor Ganjar Pranowo will be its presidential candidate for the upcoming election next year. Head of PDI-P Megawati Soekarnoputri made the announcement during a meeting of her party which was st", "date": "2023-04-21T15:01:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Indonesia,election", "source": "cna", "region": "LOCAL"},
{"title": "Japan carrier ANA Holdings raises profit estimate on cheaper fuel, yen rise", "url": "https://www.channelnewsasia.com/business/japan-carrier-ana-holdings-raises-profit-estimate-cheaper-fuel-yen-rise-3434716", "description": "TOKYO : Japan's largest airline ANA Holdings Inc on Friday raised its profit estimate for the just-ended fiscal year, citing a decline in fuel costs and an uptick in the yen.The company now expects operating profit of 120 billion yen ($897 million) in the year through March 2023, up from an earlier guida", "date": "2023-04-21T15:01:06+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Russia accidentally fires into own city of Belgorod near Ukraine, injuring three", "url": "https://www.channelnewsasia.com/world/russia-accidentally-fires-weapon-belgorod-own-city-near-ukraine-3434781", "description": "MOSCOW: A Russian Sukhoi-34 supersonic warplane accidentally fired a weapon into the city of Belgorod near Ukraine late on Thursday (Apr 20), causing an explosion and injuring three people. Video footage from the site showed piles of concrete on the street, several damaged cars and a building with broken w", "date": "2023-04-21T16:02:20+08:00", "category": "www.channelnewsasia.com", "keywords": "Russia,Ukraine", "source": "cna", "region": "LOCAL"},
{"title": "New youth panels to develop policy recommendations with the government to be launched this year", "url": "https://www.channelnewsasia.com/singapore/new-youth-panels-develop-policy-recommendations-government-3434586", "description": "Authorities hope to engage youths in “meaningful and constructive discourse” through the youth panels, said Minister for Culture, Community and Youth Edwin Tong.", "date": "2023-04-21T16:08:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Singapore Parliament,society", "source": "cna", "region": "LOCAL"},
{"title": "Pop-up museums and mini-golf: Educators explore innovative ways to improve environmental literacy", "url": "https://www.channelnewsasia.com/world/climate-museum-mini-golf-sustainability-education-environment-green-global-warming-3434721", "description": "Ahead of Earth Day on Apr 22, CNA looks at some steps being taken to improve climate and environmental awareness in New York City.", "date": "2023-04-21T16:14:12+08:00", "category": "www.channelnewsasia.com", "keywords": "Climate change,global warming,sustainability", "source": "cna", "region": "LOCAL"},
{"title": "Pritam Singh rejects criticisms that WP has no serious policies or advances populist ideas", "url": "https://www.channelnewsasia.com/singapore/parliament-pritam-singh-workers-party-policies-3434776", "description": "He was rebutting comments made by Deputy Prime Minister Lawrence Wong earlier this week, who said that the opposition should provide concrete alternatives to raise revenue and not ideas that chip away at trust in the government.", "date": "2023-04-21T17:08:16+08:00", "category": "www.channelnewsasia.com", "keywords": "Singapore Parliament,Workers Party,PAP,Pritam Singh", "source": "cna", "region": "LOCAL"},
{"title": "Grace Fu, Leon Perera debate over Singapore's developing country status at COP27", "url": "https://www.channelnewsasia.com/singapore/singapore-climate-fund-cop27-developing-country-status-grace-fu-leon-perera-3434661", "description": "SINGAPORE: Should Singapore claim or contribute to a fund to help poor countries hit by climate disasters? Singapore's position remains open, said Minister for Sustainability and the Environment Grace Fu in Parliament on Friday (Apr 21) while debating the issue with MP Leon Perera (WP-Aljunied).", "date": "2023-04-21T16:22:09+08:00", "category": "www.channelnewsasia.com", "keywords": "Singapore Parliament,environment,COP27", "source": "cna", "region": "LOCAL"},
{"title": "UK Deputy Prime Minister Dominic Raab resigns after bullying probe", "url": "https://www.channelnewsasia.com/world/united-kingdom-dominic-raab-deputy-prime-minister-resignation-bullying-complaints-rishi-sunak-3434851", "description": "LONDON: British Deputy Prime Minister Dominic Raab resigned from the government on Friday (Apr 21) following an independent investigation into complaints that he bullied colleagues, the latest scandal to force out one of Prime Minister Rishi Sunak's top ministers. The departure of the third senior minister", "date": "2023-04-21T17:33:36+08:00", "category": "www.channelnewsasia.com", "keywords": "United Kingdom,Rishi Sunak,government", "source": "cna", "region": "LOCAL"},
{"title": "South African teen dreams of becoming first Black racer in MotoGP", "url": "https://www.channelnewsasia.com/cna-lifestyle/south-african-teen-dreams-becoming-first-black-racer-motogp-3434861", "description": "JOHANNESBURG : As 14-year old Oratilwe Phiri whizzes past his father on a black and turquoise motorcycle at a racetrack east of Johannesburg, he has one goal in mind: to one day be the first Black person to race in MotoGP.Ora - as he is known - has been racing since he was four, thanks to an interest igni", "date": "2023-04-21T16:51:53+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Pilot jailed for 6 months, given financial penalty for tax offences", "url": "https://www.channelnewsasia.com/singapore/pilot-jailed-6-months-given-financial-penalty-tax-offences-3434831", "description": "The man failed to declare rental income from two properties and provided fictitious invoices to the Inland Revenue Authority of Singapore.", "date": "2023-04-21T17:00:00+08:00", "category": "www.channelnewsasia.com", "keywords": "court,Crime,tax evasion,IRAS", "source": "cna", "region": "LOCAL"},
{"title": "First look at Bird Paradise, Singapore's new bird park in Mandai", "url": "https://www.channelnewsasia.com/singapore/bird-paradise-jurong-bird-park-mandai-opens-may-8-tickets-dining-playground-3431216", "description": "Guests can walk through eight aviaries inspired by different parts of the world, such as Southeast Asia and Africa.", "date": "2023-04-21T17:36:46+08:00", "category": "www.channelnewsasia.com", "keywords": "Jurong Bird Park,Mandai Wildlife Group,tourism", "source": "cna", "region": "LOCAL"},
{"title": "BOJ likely to maintain ultra-low rates, dovish guidance next week -sources", "url": "https://www.channelnewsasia.com/business/boj-likely-maintain-ultra-low-rates-dovish-guidance-next-week-sources-3434821", "description": "TOKYO :The Bank of Japan is expected to maintain its ultra-easy monetary policy, including its interest rate targets and a 0.5 per cent cap set for the 10-year government bond yield, at next week's rate review, said four sources familiar with its thinking.At the two-day review ending on April 28, the central", "date": "2023-04-21T16:16:08+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"},
{"title": "Volkswagen increases Q1 sales despite weaker China business", "url": "https://www.channelnewsasia.com/business/volkswagen-increases-q1-sales-despite-weaker-china-business-3434901", "description": "BERLIN : Volkswagen significantly increased deliveries in the first quarter despite weaker business in China, its most important single market, the German carmaker said on Friday.The group delivered 2.04 million vehicles to customers worldwide, up 7.5 per cent compared with the same quarter last year, wh", "date": "2023-04-21T17:06:17+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna", "region": "LOCAL"}
]