[
{"title": "Malaysia to review $3.9 billion settlement deal with Goldman Sachs - PM Anwar", "url": "https://www.channelnewsasia.com/business/malaysia-review-39-billion-settlement-deal-goldman-sachs-pm-anwar-3423196", "description": "KUALA LUMPUR : The Malaysian government is re-evaluating a $3.9 billion settlement deal reached between the previous administration and U.S. investment bank Goldman Sachs over the 1MDB financial scandal, state news agency Bernama reported on Monday. Prime Minister Anwar Ibrahim said on Monday a government", "date": "2023-04-17T18:23:37+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "More chaos at Egyptian champions Zamalek as club president excluded", "url": "https://www.channelnewsasia.com/sport/more-chaos-egyptian-champions-zamalek-club-president-excluded-3423241", "description": "Five-time African champions Zamalek suffered another blow in a chaotic season as a local administrative court in Egypt ordered the removal of club president Mortada Mansour, days after the team appointed Colombian coach Juan Carlos Osorio. A local administrative court in Cairo ordered on Sunday to exclude", "date": "2023-04-17T18:46:45+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Freyr Battery teams up with Siemens on gigafactories", "url": "https://www.channelnewsasia.com/business/freyr-battery-teams-siemens-gigafactories-3423261", "description": "BERLIN : Luxembourg-based Freyr Battery sealed its partnership with Siemens at the Hannover Messe conference on Monday, making the German technology company its preferred supplier in automation and digitalization technology.Freyr plans to equip its planned gigafactories in Norway and the United States wit", "date": "2023-04-17T19:03:27+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Indonesia posts $8.7 billion Q1 budget surplus, stronger rupiah seen cutting deficit outlook", "url": "https://www.channelnewsasia.com/business/indonesia-posts-87-billion-q1-budget-surplus-stronger-rupiah-seen-cutting-deficit-outlook-3423216", "description": "JAKARTA : Indonesia posted a 128.5 trillion rupiah ($8.69 billion) budget surplus in the first quarter on strong tax collection and the recent strengthening of the rupiah currency could help further reduce this year's deficit, officials said on Monday.Indonesia's tax take rose dramatically in 2022 amid hi", "date": "2023-04-17T18:35:20+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Tesla margins in focus as EV price war kicks into high gear", "url": "https://www.channelnewsasia.com/business/tesla-margins-focus-ev-price-war-kicks-high-gear-3423206", "description": ":Tesla Inc's first-quarter margins are anticipated to have hit a more than three-year low as the electric-vehicle maker slashed prices to lure more buyers in the face of rising competition and a weak economy. The world's most valuable automaker, which commands over half of the U.S. EV market, cut sticker pric", "date": "2023-04-17T18:30:46+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "ChatGPT's AI to power Chegg study buddy as educators wrestle with tech", "url": "https://www.channelnewsasia.com/business/chatgpts-ai-power-chegg-study-buddy-educators-wrestle-tech-3423266", "description": "The artificial intelligence behind ChatGPT, the homework-drafting chatbot that some schools have banned, is coming to more students via the company Chegg Inc.The U.S. educational software maker has combined its corpus of quiz answers with the chatbot’s AI model known as GPT-4 to create CheggMate, a stud", "date": "2023-04-17T19:02:34+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Myanmar's Wa militia to suspend mining in its zone from Aug, tin prices jump", "url": "https://www.channelnewsasia.com/business/myanmars-wa-militia-suspend-mining-its-zone-aug-tin-prices-jump-3423191", "description": "Myanmar's ethnic minority Wa militia will suspend all work at mines in areas it controls from August, an information official from the militia force, the United Wa State Army (UWSA), said on Monday, driving up tin prices about 12 per cent across markets.Most of Myanmar's tin concentrate comes from mines i", "date": "2023-04-17T18:28:13+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Attack in Japan raises alarm about VIP security weeks before G7 summit", "url": "https://www.channelnewsasia.com/asia/japan-attack-fumio-kishida-vip-security-alarm-g7-summit-3423236", "description": "TOKYO: An explosive thrown at Japanese Prime Minister Fumio Kishida at an election rally on Saturday (Apr 15) has raised alarming questions about the state of VIP security, less than", "date": "2023-04-17T19:08:07+08:00", "category": "www.channelnewsasia.com", "keywords": "Japan,Fumio Kishida", "source": "cna"},
{"title": "BOJ forecasts FY2025 CPI to rise 1.6-1.9% - Jiji", "url": "https://www.channelnewsasia.com/business/boj-forecasts-fy2025-cpi-rise-16-19-jiji-3423311", "description": "TOKYO : The Bank of Japan is considering a projection for consumer prices for the 2025 fiscal year to rise 1.6-1.9 per cent, the Jiji news agency reported on Monday, in a move seen to keep market players from betting on the central bank to head to exit from stimulus.Market players are closely watching fre", "date": "2023-04-17T19:17:54+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Temperature rose above 36°C on Apr 14; warm weather set to continue: Met Service", "url": "https://www.channelnewsasia.com/singapore/temperature-rose-above-36degc-april-14-warm-weather-continue-met-service-3423221", "description": "SINGAPORE: The mercury rose above 36 degrees Celsius in the first half of April, with the warm weather in the first fortnight expected to continue for the rest of the month, the Meteorological Service Singapore (Met Service) said on Monday (Apr 17). The daily maximum temperature was above 34 degr", "date": "2023-04-17T19:52:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Meteorological Service Singapore,weather", "source": "cna"},
{"title": "China's electric car drive, led by BYD, leaves global brands behind", "url": "https://www.channelnewsasia.com/business/chinas-electric-car-drive-led-byd-leaves-global-brands-behind-3423501", "description": "SHANGHAI : China's auto market, the world’s largest, is accelerating toward an electric future – leaving established global brands stuck in the slow lane.When auto executives convene in Shanghai for the auto show starting Tuesday, they will return to a sharply different market from the one they left i", "date": "2023-04-17T21:03:14+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "EU lawmakers call for political attention to powerful AI", "url": "https://www.channelnewsasia.com/business/eu-lawmakers-call-political-attention-powerful-ai-3423396", "description": "Legislators from the European Parliament said on Monday that political attention needed to be focused on powerful artificial intelligence (AI), agreeing with an open letter signed by academics, experts and business leaders including Elon Musk on AI regulation. The EU Parliament called on European Commiss", "date": "2023-04-17T20:01:25+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Apple CEO Cook to meet Indian PM Modi amid expansion - sources", "url": "https://www.channelnewsasia.com/business/apple-ceo-cook-meet-indian-pm-modi-amid-expansion-sources-3423331", "description": "NEW DELHI : Apple Chief Executive Tim Cook will meet India's Prime Minister Narendra Modi and its deputy IT minister as part of his visit to inaugurate the iPhone maker's first retail store in the country this week, people familiar with the plans said.The visit by Cook to open the first official company-o", "date": "2023-04-17T19:35:43+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Activist investor urges Getty to partner with Meta, Microsoft to grow revenue", "url": "https://www.channelnewsasia.com/business/activist-investor-urges-getty-partner-meta-microsoft-grow-revenue-3423481", "description": "Activist investor Trillium Capital said on Monday stock-photo company Getty Images Holdings Inc should expand and create partnerships with technology firms and publishers to grow its revenue.Last week, Trillium asked Getty for a board seat and urged the company to evaluate strategic options including a sa", "date": "2023-04-17T20:34:49+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Alphabet falls on report Samsung considering Bing as default search engine", "url": "https://www.channelnewsasia.com/business/alphabet-falls-report-samsung-considering-bing-default-search-engine-3423476", "description": "Alphabet Inc shares fell over 4 per cent in premarket trading on Monday after a report that South Korea's Samsung Electronics was considering replacing Google with Microsoft-owned Bing as the default search engine on its devices.The report, published by the New York Times over the weekend, underscores the", "date": "2023-04-17T20:36:30+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "MPs propose poverty line, wealth taxes during day 1 of debate on President’s Address", "url": "https://www.channelnewsasia.com/singapore/debate-presidents-address-mps-propose-poverty-line-wealth-taxes-unemployment-support-3423366", "description": "MPs also called for tweaks to Singapore's education system and more recognition to be given to the work done by those in “practical” professions.", "date": "2023-04-17T20:20:41+08:00", "category": "www.channelnewsasia.com", "keywords": "Singapore Parliament", "source": "cna"},
{"title": "Russia jails Putin critic Kara-Murza for 25 years", "url": "https://www.channelnewsasia.com/world/russia-jails-putin-critic-kara-murza-25-years-3422336", "description": "MOSCOW: Russia on Monday (Apr 17) sentenced Kremlin critic Vladimir Kara-Murza to 25 years in a \"strict regime\" penal colony on treason and other charges for criticising the Ukraine offensive. International leaders and supporters immediately condemned the verdict, the longest against an opposition figure i", "date": "2023-04-17T21:20:29+08:00", "category": "www.channelnewsasia.com", "keywords": "Russia", "source": "cna"},
{"title": "Bank of England says may need limits on using stablecoins for payments", "url": "https://www.channelnewsasia.com/business/bank-england-says-may-need-limits-using-stablecoins-payments-3423556", "description": "LONDON : There may need to be limits initially on the use of major stablecoins for payments, and they should also be backed by high quality and liquid assets to protect consumers, Bank of England Deputy Governor Jon Cunliffe said on Monday.Britain is due to adopt rules for regulating stablecoins, a form o", "date": "2023-04-17T21:21:00+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Adobe to add generative AI tools into its video editing software ", "url": "https://www.channelnewsasia.com/business/adobe-add-generative-ai-tools-its-video-editing-software-3423516", "description": "Adobe Inc on Monday said it plans to introduce new artificial intelligence (AI) features into its video editing software used by the film and television industries.The tools will let video editors do things like change the lighting in a shot from midday to sunset or generate background music just by typin", "date": "2023-04-17T21:05:20+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"}
][
{"title": "The Uptake | Monday Musings", "url": "https://kr-asia.com/the-uptake-monday-musings", "description": "Everything you need to start your week right, plus a piping hot coffee.", "date": "2023-04-17T03:00:29+00:00", "category": "Newsletters", "keywords": null, "source": "krasia"},
{"title": "5 Takeaways From Venturra’s Report On The State Of Climate Tech In Southeast Asia", "url": "https://kr-asia.com/5-takeaways-from-venturras-report-on-the-state-of-climate-tech-in-southeast-asia", "description": "This flourishing field could result in both financial returns and a positive impact on the environment.", "date": "2023-04-14T09:15:03+00:00", "category": "Insights", "keywords": null, "source": "krasia"},
{"title": "Bytedance’s Lemon8 App Gains Popularity in the US Market", "url": "https://kr-asia.com/bytes-lemon8-app-gains-popularity-in-the-us-market", "description": "Byte's new lifestyle app Lemon8 unexpectedly takes the US app market by storm, even ranking first in the lifestyle app category.", "date": "2023-04-13T05:29:30+00:00", "category": "News", "keywords": null, "source": "krasia"},
{"title": "Toyota Unveils Plan to Catch Up to Tesla and BYD in Electric Vehicle Market", "url": "https://kr-asia.com/toyota-unveils-plan-to-catch-up-to-tesla-and-byd-in-electric-vehicle-market", "description": "Toyota aims to launch 10 new EV models by 2026 and reach global annual sales of 1.5 million to catch up with Tesla and BYD.", "date": "2023-04-14T05:47:47+00:00", "category": "News", "keywords": null, "source": "krasia"},
{"title": "Startup Wire | The Come Up", "url": "https://kr-asia.com/startup-wire-the-come-up", "description": "The latest startup briefs from across the Asia Pacific region.", "date": "2023-04-14T09:00:05+00:00", "category": "Newsletters", "keywords": null, "source": "krasia"},
{"title": "Revving Up the Future: The Impact of Emerging Transportation Trends in Southeast Asia", "url": "https://kr-asia.com/revving-up-the-future-the-impact-of-emerging-transportation-trends-in-southeast-asia", "description": "Flying cars would be great, but for now, electric vehicles and autonomous cars are pushing the boundaries of how we think about transportation.", "date": "2023-04-12T08:22:30+00:00", "category": "Insights", "keywords": null, "source": "krasia"},
{"title": "Europe, Japan can help ease rollout of EV battery rules: EU official", "url": "https://kr-asia.com/europe-japan-can-help-ease-rollout-of-ev-battery-rules-eu-official", "description": "Cooperation is critical to lowering the regulatory burden on carmakers and suppliers.", "date": "2023-04-17T07:18:36+00:00", "category": "News", "keywords": null, "source": "krasia"},
{"title": "The Rise and Fall of Online Budget Retailers", "url": "https://kr-asia.com/the-rise-and-fall-of-online-budget-retailers", "description": "The successes and challenges of Temu offer insights into the wild ride of e-commerce platforms offering low-priced goods.", "date": "2023-04-13T06:02:22+00:00", "category": "Insights", "keywords": null, "source": "krasia"},
{"title": "Climate technology for a more sustainable Southeast Asia ", "url": "https://kr-asia.com/climate-technology-for-a-more-sustainable-southeast-asia", "description": "Southeast Asian companies are utilizing carbon markets and alternative fuels to combat climate change and build more resilient communities.", "date": "2023-04-13T04:59:38+00:00", "category": "Deloitte Southeast Asia Innovation Insights", "keywords": null, "source": "krasia"},
{"title": "Grab Launches New Travel-Focused Features for Post-Pandemic Tourism Industry", "url": "https://kr-asia.com/grab-launches-new-travel-focused-features-for-post-pandemic-tourism-industry", "description": "The ride-hailing giant introduces travel-focused features through partner integrations with WeChat, Alipay, and Kakao T to ensure a seamless booking and payment experience for travelers.", "date": "2023-04-17T07:47:26+00:00", "category": "News", "keywords": null, "source": "krasia"}
]