[
{"title": "Wildfire on French-Spanish border destroys 1,000 hectares", "url": "https://www.channelnewsasia.com/sustainability/wildfire-french-spanish-borders-destory-1000-hectares-3423071", "description": "PARIS: A wildfire destroyed nearly 1,000ha on the French-Spanish border on Sunday (Apr 16) and early Monday, authorities said, as parts of southern Europe remain gripped by a drought that is raising fears of a repeat of last summer's exceptional conflagrations. The blaze, France's first major wildfire this", "date": "2023-04-17T18:18:40+08:00", "category": "www.channelnewsasia.com", "keywords": "wildfire", "source": "cna"},
{"title": "Myanmar's Wa militia to suspend mining in its zone from Aug, tin prices jump", "url": "https://www.channelnewsasia.com/business/myanmars-wa-militia-suspend-mining-its-zone-aug-tin-prices-jump-3423191", "description": "Myanmar's ethnic minority Wa militia will suspend all work at mines in areas it controls from August, an information official from the militia force, the United Wa State Army (UWSA), said on Monday, driving up tin prices about 12 per cent across markets.Most of Myanmar's tin concentrate comes from mines i", "date": "2023-04-17T18:28:13+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Malaysia to review $3.9 billion settlement deal with Goldman Sachs - PM Anwar", "url": "https://www.channelnewsasia.com/business/malaysia-review-39-billion-settlement-deal-goldman-sachs-pm-anwar-3423196", "description": "KUALA LUMPUR : The Malaysian government is re-evaluating a $3.9 billion settlement deal reached between the previous administration and U.S. investment bank Goldman Sachs over the 1MDB financial scandal, state news agency Bernama reported on Monday. Prime Minister Anwar Ibrahim said on Monday a government", "date": "2023-04-17T18:23:37+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "More chaos at Egyptian champions Zamalek as club president excluded", "url": "https://www.channelnewsasia.com/sport/more-chaos-egyptian-champions-zamalek-club-president-excluded-3423241", "description": "Five-time African champions Zamalek suffered another blow in a chaotic season as a local administrative court in Egypt ordered the removal of club president Mortada Mansour, days after the team appointed Colombian coach Juan Carlos Osorio. A local administrative court in Cairo ordered on Sunday to exclude", "date": "2023-04-17T18:46:45+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Indonesia posts $8.7 billion Q1 budget surplus, stronger rupiah seen cutting deficit outlook", "url": "https://www.channelnewsasia.com/business/indonesia-posts-87-billion-q1-budget-surplus-stronger-rupiah-seen-cutting-deficit-outlook-3423216", "description": "JAKARTA : Indonesia posted a 128.5 trillion rupiah ($8.69 billion) budget surplus in the first quarter on strong tax collection and the recent strengthening of the rupiah currency could help further reduce this year's deficit, officials said on Monday.Indonesia's tax take rose dramatically in 2022 amid hi", "date": "2023-04-17T18:35:20+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "China smartphone sales rise to more than 70% of Russian market ", "url": "https://www.channelnewsasia.com/business/china-smartphone-sales-rise-more-70-russian-market-3423296", "description": "Chinese smartphones made up more than 70 per cent of the Russian market in the first quarter of 2023, consumer electronics retailer M.Video-Eldorado said, up from around 50 per cent last year.China's smartphone surge comes after Samsung and Apple both curtailed sales in Russia over the conflict in Ukraine", "date": "2023-04-17T19:12:30+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "ChatGPT's AI to power Chegg study buddy as educators wrestle with tech", "url": "https://www.channelnewsasia.com/business/chatgpts-ai-power-chegg-study-buddy-educators-wrestle-tech-3423266", "description": "The artificial intelligence behind ChatGPT, the homework-drafting chatbot that some schools have banned, is coming to more students via the company Chegg Inc.The U.S. educational software maker has combined its corpus of quiz answers with the chatbot’s AI model known as GPT-4 to create CheggMate, a stud", "date": "2023-04-17T19:02:34+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Attack in Japan raises alarm about VIP security weeks before G7 summit", "url": "https://www.channelnewsasia.com/asia/japan-attack-fumio-kishida-vip-security-alarm-g7-summit-3423236", "description": "TOKYO: An explosive thrown at Japanese Prime Minister Fumio Kishida at an election rally on Saturday (Apr 15) has raised alarming questions about the state of VIP security, less than", "date": "2023-04-17T19:08:07+08:00", "category": "www.channelnewsasia.com", "keywords": "Japan,Fumio Kishida", "source": "cna"},
{"title": "EU lawmakers call for political attention to powerful AI", "url": "https://www.channelnewsasia.com/business/eu-lawmakers-call-political-attention-powerful-ai-3423396", "description": "Legislators from the European Parliament said on Monday that political attention needed to be focused on powerful artificial intelligence (AI), agreeing with an open letter signed by academics, experts and business leaders including Elon Musk on AI regulation. The EU Parliament called on European Commiss", "date": "2023-04-17T20:01:25+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Apple CEO Cook to meet Indian PM Modi amid expansion - sources", "url": "https://www.channelnewsasia.com/business/apple-ceo-cook-meet-indian-pm-modi-amid-expansion-sources-3423331", "description": "NEW DELHI : Apple Chief Executive Tim Cook will meet India's Prime Minister Narendra Modi and its deputy IT minister as part of his visit to inaugurate the iPhone maker's first retail store in the country this week, people familiar with the plans said.The visit by Cook to open the first official company-o", "date": "2023-04-17T19:35:43+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Temperature rose above 36°C on Apr 14; warm weather set to continue: Met Service", "url": "https://www.channelnewsasia.com/singapore/temperature-rose-above-36degc-april-14-warm-weather-continue-met-service-3423221", "description": "SINGAPORE: The mercury rose above 36 degrees Celsius in the first half of April, with the warm weather in the first fortnight expected to continue for the rest of the month, the Meteorological Service Singapore (Met Service) said on Monday (Apr 17). The daily maximum temperature was above 34 degr", "date": "2023-04-17T19:52:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Meteorological Service Singapore,weather", "source": "cna"},
{"title": "Alphabet falls on report Samsung considering Bing as default search engine", "url": "https://www.channelnewsasia.com/business/alphabet-falls-report-samsung-considering-bing-default-search-engine-3423476", "description": "Alphabet Inc shares fell over 4 per cent in premarket trading on Monday after a report that South Korea's Samsung Electronics was considering replacing Google with Microsoft-owned Bing as the default search engine on its devices.The report, published by the New York Times over the weekend, underscores the", "date": "2023-04-17T20:36:30+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "MPs propose poverty line, wealth taxes during day 1 of debate on President’s Address", "url": "https://www.channelnewsasia.com/singapore/debate-presidents-address-mps-propose-poverty-line-wealth-taxes-unemployment-support-3423366", "description": "MPs also called for tweaks to Singapore's education system and more recognition to be given to the work done by those in “practical” professions.", "date": "2023-04-17T20:20:41+08:00", "category": "www.channelnewsasia.com", "keywords": "Singapore Parliament", "source": "cna"},
{"title": "Activist investor urges Getty to partner with Meta, Microsoft to grow revenue", "url": "https://www.channelnewsasia.com/business/activist-investor-urges-getty-partner-meta-microsoft-grow-revenue-3423481", "description": "Activist investor Trillium Capital said on Monday stock-photo company Getty Images Holdings Inc should expand and create partnerships with technology firms and publishers to grow its revenue.Last week, Trillium asked Getty for a board seat and urged the company to evaluate strategic options including a sa", "date": "2023-04-17T20:34:49+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "China's electric car drive, led by BYD, leaves global brands behind", "url": "https://www.channelnewsasia.com/business/chinas-electric-car-drive-led-byd-leaves-global-brands-behind-3423501", "description": "SHANGHAI : China's auto market, the world’s largest, is accelerating toward an electric future – leaving established global brands stuck in the slow lane.When auto executives convene in Shanghai for the auto show starting Tuesday, they will return to a sharply different market from the one they left i", "date": "2023-04-17T21:03:14+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Tesla margins in focus as EV price war kicks into high gear", "url": "https://www.channelnewsasia.com/business/tesla-margins-focus-ev-price-war-kicks-high-gear-3423206", "description": ":Tesla Inc's first-quarter margins are anticipated to have hit a more than three-year low as the electric-vehicle maker slashed prices to lure more buyers in the face of rising competition and a weak economy. The world's most valuable automaker, which commands over half of the U.S. EV market, cut sticker pric", "date": "2023-04-17T18:30:46+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Analysis:Rocket startups face adapt-or-die moment amid investment drought", "url": "https://www.channelnewsasia.com/business/analysisrocket-startups-face-adapt-or-die-moment-amid-investment-drought-3423176", "description": "WASHINGTON : Demand for sending satellites into space remains strong, but U.S. rocket startups are taking drastic measures to survive a tight funding environment where fears have been exacerbated by the bankruptcy of Virgin Orbit.The industry faces an interesting dichotomy. Demand has surged from launchin", "date": "2023-04-17T18:16:05+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Tencent says its self-developed video transcoding chip enters mass production ", "url": "https://www.channelnewsasia.com/business/tencent-says-its-self-developed-video-transcoding-chip-enters-mass-production-3423181", "description": "HONG KONG : Chinese tech giant Tencent Holdings said on Monday its self-developed video transcoding chip Canghai has entered mass production and is currently supporting services from cloud gaming to video live streaming. The Shenzhen-based company, best known for its popular messaging platform WeChat, sai", "date": "2023-04-17T18:19:55+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Freyr Battery teams up with Siemens on gigafactories", "url": "https://www.channelnewsasia.com/business/freyr-battery-teams-siemens-gigafactories-3423261", "description": "BERLIN : Luxembourg-based Freyr Battery sealed its partnership with Siemens at the Hannover Messe conference on Monday, making the German technology company its preferred supplier in automation and digitalization technology.Freyr plans to equip its planned gigafactories in Norway and the United States wit", "date": "2023-04-17T19:03:27+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "BOJ forecasts FY2025 CPI to rise 1.6-1.9% - Jiji", "url": "https://www.channelnewsasia.com/business/boj-forecasts-fy2025-cpi-rise-16-19-jiji-3423311", "description": "TOKYO : The Bank of Japan is considering a projection for consumer prices for the 2025 fiscal year to rise 1.6-1.9 per cent, the Jiji news agency reported on Monday, in a move seen to keep market players from betting on the central bank to head to exit from stimulus.Market players are closely watching fre", "date": "2023-04-17T19:17:54+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"}
]