[
{"title": "Display maker JOLED to restructure with JDI support", "url": "https://www.channelnewsasia.com/business/display-maker-joled-restructure-jdi-support-3376851", "description": "TOKYO : JOLED Inc, the Japanese company that took over Sony and Panasonic's OLED display businesses, has filed for rehabilitation proceedings through the Tokyo District Court, the debt-laden company said on Monday.The company also said it has executed a basic agreement with Japan Display Inc (JDI) to supp", "date": "2023-03-27T18:21:34+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "EDB, Enterprise Singapore to get new chiefs", "url": "https://www.channelnewsasia.com/singapore/edb-enterprisesg-permanent-secretary-appointments-new-chiefs-3376796", "description": "New permanent secretary appointments have also been announced at several ministries.", "date": "2023-03-27T19:03:00+08:00", "category": "www.channelnewsasia.com", "keywords": "permanent secretary,Economic Development Board,Enterprise Singapore", "source": "cna"},
{"title": "Japan lawmakers eye ban on TikTok, others if used improperly", "url": "https://www.channelnewsasia.com/business/japan-lawmakers-ban-tiktok-others-if-used-improperly-3376841", "description": "TOKYO: A group of Japan's ruling Liberal Democratic Party (LDP) lawmakers plans to compile a proposal next month urging the government to ban social networking services such as TikTok if they are used for disinformation campaigns, an LDP lawmaker said on Monday (Mar 26). Many US lawmakers are calling on th", "date": "2023-03-27T18:33:00+08:00", "category": "www.channelnewsasia.com", "keywords": "TikTok,Japan", "source": "cna"},
{"title": "PM Anwar thanks Cambodia for bringing back Malaysian job scam victims", "url": "https://www.channelnewsasia.com/asia/malaysia-cambodia-anwar-ibrahim-hun-sen-job-scam-syndicate-3376821", "description": "PHNOM PENH: Malaysian Prime Minister Anwar Ibrahim expressed appreciation to his Cambodian counterpart Hun Sen for the latter’s support in bringing back Malaysian victims of a job scam syndicate in Cambodia. “Thank you very much; it means a lot to hundreds of families affected by this scam,” said Mr", "date": "2023-03-27T18:26:18+08:00", "category": "www.channelnewsasia.com", "keywords": "Malaysia,Cambodia,Crime", "source": "cna"},
{"title": "Largest strike in decades brings Germany to a standstill", "url": "https://www.channelnewsasia.com/world/largest-strike-germany-decades-standstill-transport-3376971", "description": "BERLIN/FRANKFURT: Airports and bus and train stations across Germany were at a standstill on Monday (Mar 27), causing disruption for millions at the start of the working week during one of the largest walko", "date": "2023-03-27T20:01:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Germany,strike,protests", "source": "cna"},
{"title": "Germany to buy up to 28 howitzers to help replace arms rushed to Ukraine", "url": "https://www.channelnewsasia.com/world/germany-buy-28-howitzers-help-replace-arms-rushed-ukraine-3376966", "description": "BERLIN: Germany aims to purchase up to 28 self-propelled howitzers to replace weapons rushed to Ukraine out of army stocks last year, according to a budget draft seen by Reuters on Monday (Mar 26). Heavy artillery-type weapons such as howitzers, long perceived as arms of the past by military experts, have", "date": "2023-03-27T20:02:27+08:00", "category": "www.channelnewsasia.com", "keywords": "Germany,Ukraine,Ukraine invasion", "source": "cna"},
{"title": "Crown Resorts says ransomware group claims accessing some of its files", "url": "https://www.channelnewsasia.com/business/crown-resorts-says-ransomware-group-claims-accessing-some-its-files-3376876", "description": ":Crown Resorts said on Monday a ransomware group had contacted the company, claiming that they had gained access to some files related to Australia's biggest casino operator following a data breach at a file transfer service GoAnywhere.\"We were recently contacted by a ransomware group who claimed they have il", "date": "2023-03-27T18:36:00+08:00", "category": "www.channelnewsasia.com", "keywords": "casino,cybersecurity,Australia", "source": "cna"},
{"title": "IOC should stick to ban on Russian, Belarusian athletes: Poland, UK, Baltic states", "url": "https://www.channelnewsasia.com/sport/ioc-ban-russian-belarusian-athletes-poland-uk-baltic-states-3376791", "description": "WARSAW: Russian and Belarusian athletes should be banned from the 2024 Olympics in Paris unless Moscow pulls its forces out of Ukraine, according to Poland, Britain and the Baltic states, despite the International Olympic Committee saying it plans to let them compete as neutrals. The IOC sanctioned Russia", "date": "2023-03-27T18:25:00+08:00", "category": "www.channelnewsasia.com", "keywords": "Olympics,Paris,Poland,Russia,Belarus", "source": "cna"},
{"title": "Thailand's PTT Oil and Retail to spend $900 million on expansion this year", "url": "https://www.channelnewsasia.com/business/thailands-ptt-oil-and-retail-spend-900-million-expansion-year-3376891", "description": "BANGKOK : Thailand's oil and gas retailer, PTT Oil and Retail Business Pcl on Monday said it plans to invest $900 million this year to expand its local and overseas business. About 45 per cent of the budget will be used to expand its coffee house franchise, Cafe Amazon and fried chicken chain, Texas Chick", "date": "2023-03-27T18:45:50+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Chelsea post £121.3 million loss, blame sanctions on ex-owner Abramovich", "url": "https://www.channelnewsasia.com/sport/chelsea-post-ps1213-million-loss-blame-sanctions-ex-owner-abramovich-3376926", "description": "Chelsea had an overall net loss of £121.3 million (US$148.65 million) for 2021-22 due to \"extraordinary expenses and loss of revenue\" after sanctions were imposed on previous owner Roman Abramovich, the Premier League club said on Monday (Mar 27). Russian owner Abramovich put the club up for sale in early", "date": "2023-03-27T19:03:00+08:00", "category": "www.channelnewsasia.com", "keywords": "English Premier League,Chelsea FC,Football", "source": "cna"},
{"title": "India's parliament adjourned after protests over Gandhi expulsion", "url": "https://www.channelnewsasia.com/asia/indias-parliament-adjourned-after-protests-over-gandhi-expulsion-3377031", "description": "NEW DELHI: India's parliament was adjourned twice on Monday (Mar 26) after lawmakers held rowdy protests and threw paper at the speaker following the expulsion from the house", "date": "2023-03-27T20:28:27+08:00", "category": "www.channelnewsasia.com", "keywords": "India", "source": "cna"},
{"title": "World Bank warns of 'lost decade' in global growth without bold policy shifts", "url": "https://www.channelnewsasia.com/business/world-bank-warns-lost-decade-global-growth-without-bold-policy-shifts-3377326", "description": "WASHINGTON: Average potential global economic growth will slump to a three-decade low of 2.2 per cent per year through 2030, ushering in a \"lost decade\" for the world's economy, unless policymakers adopt ambitious initiatives to boost labour supply, productivity and investment, the World Bank warned on Monday (Mar 2", "date": "2023-03-27T21:41:00+08:00", "category": "www.channelnewsasia.com", "keywords": "economy,global economy,World Bank", "source": "cna"},
{"title": "Analysis:The $15 billion scramble for Japan's Toshiba went from bang to whimper", "url": "https://www.channelnewsasia.com/business/analysisthe-15-billion-scramble-japans-toshiba-went-bang-whimper-3377241", "description": "TOKYO : Toshiba Corp's auction was supposed to ignite a race for top-dollar bids among global private equity firms. Instead, it brought months of uncertainty and a solitary, scaled-back offer from the company's business partners in Japan.The $15 billion bid, led by domestic buyout firm Japan Industrial Pa", "date": "2023-03-27T21:11:01+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Scotland full back Hogg to retire after World Cup", "url": "https://www.channelnewsasia.com/sport/scotland-full-back-hogg-retire-after-world-cup-3377266", "description": "Scotland's record try scorer Stuart Hogg will retire from professional rugby after the World Cup in France later this year, the full back who has 100 caps said on Monday.Hogg made his debut for Scotland in February 2012 and played his 100th international in this year's Six Nations when he played against I", "date": "2023-03-27T21:18:25+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Triathlon-Drafting detection system to be used at Ibiza world championships", "url": "https://www.channelnewsasia.com/sport/triathlon-drafting-detection-system-be-used-ibiza-world-championships-3377341", "description": "A drafting detection system will be used at the Long Distance World Championships in Ibiza in May to help officials detect riders who are illegally making use of a slipstream, World Triathlon said on Monday.The RaceRanger drafting detection system was tested in four non-drafting events in New Zealand and", "date": "2023-03-27T21:46:14+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "China Energy plans 1000 MW floating solar plant in Zimbabwe", "url": "https://www.channelnewsasia.com/business/china-energy-plans-1000-mw-floating-solar-plant-zimbabwe-3377146", "description": "HARARE : China Energy Engineering Corp. (China Energy) has proposed the construction of a 1,000 megawatt floating solar plant on Zimbabwe's Kariba dam at a cost of nearly $1 billion, documents showed on Monday.The southern African country is currently generating less than half of its 1,700MW power demand,", "date": "2023-03-27T20:30:48+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "China's Bestpath to go public in US via $1.2 billion SPAC deal", "url": "https://www.channelnewsasia.com/business/chinas-bestpath-go-public-us-12-billion-spac-deal-3377211", "description": "Chinese tech firm Bestpath said on Monday it had agreed to go public in the United States through a merger with a blank-check vehicle in a deal with an equity value of about $1.2 billion. Founded in 2019, Bestpath is a hydrogen fuel cell powered vehicle company and has a Shanghai-based R&D facility to adv", "date": "2023-03-27T21:00:56+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"},
{"title": "Blackbaud rejects $71/shr offer from stakeholder Clearlake", "url": "https://www.channelnewsasia.com/business/blackbaud-rejects-71-shr-offer-stakeholder-clearlake-3377141", "description": ":Blackbaud Inc on Monday rejected a buyout offer from its largest shareholder Clearlake Capital that valued the software firm at $3.78 billion.Clearlake made an offer of $71 per share in cash, a premium of nearly 23 per cent to Blackbaud's Friday close.Blackbaud's shares were up 15 per cent at $66.99 i", "date": "2023-03-27T20:31:12+08:00", "category": "www.channelnewsasia.com", "keywords": null, "source": "cna"}
]